# 词性
POS = {
    "a": "形容词",
    "ad": "副形词",
    "ag": "形语素",
    "an": "名形词",
    "b": "区别词",
    "c": "连词",
    "d": "副词",
    "dg": "副语素",
    "e": "叹词",
    "f": "方位名词",
    "g": "语素",
    "h": "前接成分",
    "i": "成语",
    "j": "简称略语",
    "k": "后接成分",
    "l": "习惯语",
    "m": "数量词",
    "n": "普通名词",
    "ng": "名语素",
    "nr": "人名",
    "ns": "地名",
    "nt": "机构团体名",
    "nw": "作品名",
    "nz": "其他专名",
    "o": "拟声词",
    "p": "介词",
    "q": "量词",
    "r": "代词",
    "s": "处所名词",
    "t": "时间名词",
    "tg": "时语素",
    "u": "助词",
    "un": "未知词",
    "v": "普通动词",
    "vd": "动副词",
    "vg": "动语素",
    "vn": "动名词",
    "w": "标点符号",
    "x": "非语素字",
    "xc": "其他虚词",
    "y": "语气词",
    "z": "状态词",
    "PER": "人名",
    "LOC": "地名",
    "ORG": "机构名",
    "TIME": "时间",
    "": "/"
}

# 专有名词
NE = {
    "PER": "人名",
    "LOC": "地名",
    "ORG": "机构名",
    "TIME": "时间",
    "": "/"
}

# 依存关系
DEPRE = {
    "SBV": "主谓关系",
    "VOB": "动宾关系",
    "POB": "介宾关系",
    "ADV": "状中关系",
    "CMP": "动补关系",
    "ATT": "定中关系",
    "F": "方位关系",
    "COO": "并列关系",
    "DBL": "兼语结构",
    "DOB": "双宾语结构",
    "VV": "连谓结构",
    "IC": "子句结构",
    "MT": "虚词成分",
    "HED": "核心关系",
    "": ""
}

# 评论行业类型
COMMENTTYPE = {
    "酒店": 1,
    "KTV": 2,
    "丽人": 3,
    "美食餐饮": 4,
    "旅游": 5,
    "健康": 6,
    "教育": 7,
    "商业": 8,
    "房产": 9,
    "汽车": 10,
    "生活": 11,
    "购物": 12,
    "3C": 13
}
